cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "homebrew/bundle"

tap "getantibody/tap"
tap "golangci/tap"
tap "github/gh"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "kaos/shell"

brew "antibody"
brew "bat"
brew "ctags"
brew "direnv"
brew "fasd"
brew "fd"
brew "fzf"
brew "gawk"
brew "git"
brew "github/gh/gh"
brew "go"
brew "grep"
brew "jq"
brew "neovim"
brew "prettyping"
brew "rename"
brew "ripgrep"
brew "screen"
brew "the_silver_searcher"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"
brew "zsh"

# Honking big ones
brew "gcc"

# GNU Tools
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "findutils"

brew "awscli"
brew 'fswatch'
brew 'hub'
brew 'pv'
brew 'watchman'
brew "pgcli"

# bash
brew "bash"
brew "shellcheck"
brew "bats-assert",  args: ["ignore-dependencies"]
brew "bats-file",  args: ["ignore-dependencies"]
brew "shfmt"

# GPG
# brew "gpg-agent"
# brew "gpg2"
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# go
brew "golangci-lint"

# Ruby
brew "rbenv"

# Python
brew "pyenv"

cask "1password-cli"
cask "proxyman"
cask "discord"
cask "firefox"
cask "fork"
cask "karabiner-elements"
cask "iterm2"
cask "paw"
cask "rectangle"
cask "sensiblesidebuttons"
cask "spotify"
cask "viscosity"
cask "visual-studio-code"

# Work-specific casks
#cask "docker"
#cask "pycharm"
#cask "slack"
