cask_args appdir: '/Applications'

vim bash zsh git pyenv tree ag fzf prettyping gnupg pinentry-mac jq tidy-html5 fd


tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'kaos/shell'
tap 'getantibody/tap'

# Maybe
brew 'direnv'
brew 'fasd'
brew 'mas'

brew "antibody"
brew "ctags"
brew "fzf"
brew "gawk"
brew "gcc"
brew "git"
brew "github/gh/gh"
brew "grep"
brew "jq"
brew "neovim"
brew "prettyping"
brew "rename"
brew "screen"
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "zsh"

# GNU Tools
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"

brew "awscli"
brew 'fswatch'
brew 'hub'
brew 'pv'
brew 'watchman'
brew "pgcli"

# bash
brew "bash"
brew "shellcheck"
brew "bats-assert",  args: ["ignore-dependencies"]
brew "bats-file",  args: ["ignore-dependencies"]
brew "shfmt"

# GPG
# brew "gpg-agent"
# brew "gpg2"
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"

# Ruby
brew "rbenv"

# Python
brew "pyenv"

cask "insomnia"
